# Effective JavaScript

## 목차
* 변수 스코프 
  - 클로저에 익숙해져라
  - 변수 호이스팅에 대해 이해하라
  - 지역변수 스코프를 만들기 위해 즉시 실행함수 표현식을 사용하라
  - 기명 함수 표현식의 스코프에 주의하라
  - 블록-지역 하수 선언문의 스코프에 주의하라

* 함수 사용하기
  - 함수, 메서드, 생성자 호출의 차이를 이해하라
  - 고차 함수에 익숙해져라
  - 지정된 수신자 객체로 함수를 호출하기 위해 call 메서드를 사용하라
  - 다른 개수의 인자로 함수를 호출하기 위해 apply를 사용하라
  - 가변 인자 함수를 생성하기 위해 arguments를 사용하라
  - 고정된 수신자 객체로 메서드를 추축하기 위해 bind를 사용하라
  - 커링 함수에 bind를 사용하라
  - 코드를 캡슐화하기 위해 문자열 보다 클로저를 사용하라
  
* 객체와 프로토타입   
  - __proto__보다 Object.getPrototypeOf를 사용하라
